Maxjta/hal_at32/include/dt-bindings/pinctrl/at32f403a_407-iomap.h
/*
 * Copyright (c) 2025 maxjta
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef AT32F403A_407_IOMAP_H_
#define AT32F403A_407_IOMAP_H_

#include "at32_iomap.h"

#define AT32_NO_REMAP     AT32_REMAP(5, 0, 1, 0x00)

/* TMR9 */
#define AT32_TMR9_NORMP    AT32_REMAP(0, 0, 4, 0x00)
#define AT32_TMR9_RMP      AT32_REMAP(0, 0, 4, 0x01)

/* TMR1 */
#define AT32_TMR1_NORMP    AT32_REMAP(1, 0, 4, 0x00)
#define AT32_TMR1_RMP1     AT32_REMAP(1, 0, 4, 0x01)
#define AT32_TMR1_RMP3     AT32_REMAP(1, 0, 4, 0x03)

/* TMR2 */
#define AT32_TMR2_NORMP    AT32_REMAP(1, 4, 2, 0x00)
#define AT32_TMR2_RMP1     AT32_REMAP(1, 4, 2, 0x01)
#define AT32_TMR2_RMP2     AT32_REMAP(1, 4, 2, 0x02)
#define AT32_TMR2_RMP3     AT32_REMAP(1, 4, 2, 0x03)
#define AT32_TMR2_ITR1_NORMP AT32_REMAP(1, 6, 2, 0x00)
#define AT32_TMR2_ITR1_RMP2 AT32_REMAP(1, 6, 2, 0x02)
#define AT32_TMR2_ITR1_RMP3 AT32_REMAP(1, 6, 2, 0x03)

/* TMR3 */
#define AT32_TMR3_NORMP    AT32_REMAP(1, 8, 4, 0x00)
#define AT32_TMR3_RMP2     AT32_REMAP(1, 8, 4, 0x02)
#define AT32_TMR3_RMP3     AT32_REMAP(1, 8, 4, 0x03)

/* TMR4 */
#define AT32_TMR4_NORMP    AT32_REMAP(1, 12, 4, 0x00)
#define AT32_TMR4_RMP1     AT32_REMAP(1, 12, 4, 0x01)

/* TMR5 */
#define AT32_TMR5CH4_NORMP    AT32_REMAP(1, 19, 1, 0x00)
#define AT32_TMR5CH4_RMP1     AT32_REMAP(1, 19, 1, 0x01)
#define AT32_TMR5_NORMP       AT32_REMAP(5, 0, 1, 0x00)

/* TMR8 */
#define AT32_TMR8_NORMP       AT32_NO_REMAP

/* TMR10 */
#define AT32_TMR10_NORMP      AT32_NO_REMAP

/* TMR11 */
#define AT32_TMR11_NORMP      AT32_NO_REMAP

/* TMR12 */
#define AT32_TMR12_NORMP      AT32_NO_REMAP

/* TMR13 */
#define AT32_TMR13_NORMP      AT32_NO_REMAP

/* TMR14 */
#define AT32_TMR14_NORMP      AT32_NO_REMAP

/* UART5 */
#define AT32_UART5_NORMP   AT32_REMAP(2, 0, 4, 0x00)
#define AT32_UART5_RMP1    AT32_REMAP(2, 0, 4, 0x01)

/* I2C1 */
#define AT32_I2C1_NORMP   AT32_REMAP(2, 4, 4, 0x00)
#define AT32_I2C1_RMP1    AT32_REMAP(2, 4, 4, 0x01)

/* I2C2 */
#define AT32_I2C2_NORMP   AT32_NO_REMAP

/* I2C3 */
#define AT32_I2C3_NORMP   AT32_REMAP(2, 12, 4, 0x00)
#define AT32_I2C3_RMP1    AT32_REMAP(2, 12, 4, 0x01)

/* SPI1 */
#define AT32_SPI1_NORMP   AT32_REMAP(2, 16, 4, 0x00)
#define AT32_SPI1_RMP1    AT32_REMAP(2, 16, 4, 0x01)
#define AT32_SPI1_RMP2    AT32_REMAP(2, 16, 4, 0x02)
#define AT32_SPI1_RMP3    AT32_REMAP(2, 16, 4, 0x03)

/* SPI2 */
#define AT32_SPI2_NORMP   AT32_REMAP(2, 20, 4, 0x00)
#define AT32_SPI2_RMP1    AT32_REMAP(2, 20, 4, 0x01)
#define AT32_SPI2_RMP2    AT32_REMAP(2, 20, 4, 0x02)

/* SPI3 */
#define AT32_SPI3_NORMP   AT32_REMAP(2, 24, 4, 0x00)
#define AT32_SPI3_RMP1    AT32_REMAP(2, 24, 4, 0x01)
#define AT32_SPI3_RMP2    AT32_REMAP(2, 24, 4, 0x02)
#define AT32_SPI3_RMP3    AT32_REMAP(2, 24, 4, 0x03)

/* SPI4 */
#define AT32_SPI4_NORMP   AT32_REMAP(2, 28, 4, 0x00)
#define AT32_SPI4_RMP1    AT32_REMAP(2, 28, 4, 0x01)
#define AT32_SPI4_RMP2    AT32_REMAP(2, 28, 4, 0x02)
#define AT32_SPI4_RMP3    AT32_REMAP(2, 28, 4, 0x03)

/* CAN1 */
#define AT32_CAN1_NORMP   AT32_REMAP(3, 0, 4, 0x00)
#define AT32_CAN1_RMP2    AT32_REMAP(3, 0, 4, 0x02)
#define AT32_CAN1_RMP3    AT32_REMAP(3, 0, 4, 0x03)

/* CAN2 */
#define AT32_CAN2_NORMP   AT32_REMAP(3, 4, 4, 0x00)
#define AT32_CAN2_RMP1    AT32_REMAP(3, 4, 4, 0x01)

/* SDIO2 */
#define AT32_SDIO2_NORMP  AT32_REMAP(3, 12, 4, 0x00)
#define AT32_SDIO2_RMP1   AT32_REMAP(3, 12, 4, 0x01)
#define AT32_SDIO2_RMP2   AT32_REMAP(3, 12, 4, 0x02)
#define AT32_SDIO2_RMP3   AT32_REMAP(3, 12, 4, 0x03)

/* USART1 */
#define AT32_USART1_NORMP  AT32_REMAP(3, 16, 4, 0x00)
#define AT32_USART1_RMP1   AT32_REMAP(3, 16, 4, 0x01)

/* USART2 */
#define AT32_USART2_NORMP  AT32_REMAP(3, 20, 4, 0x00)
#define AT32_USART2_RMP1   AT32_REMAP(3, 20, 4, 0x01)

/* USART3 */
#define AT32_USART3_NORMP  AT32_REMAP(3, 24, 4, 0x00)
#define AT32_USART3_RMP1   AT32_REMAP(3, 24, 4, 0x01)
#define AT32_USART3_RMP3   AT32_REMAP(3, 24, 4, 0x03)

/* UART4 */
#define AT32_UART4_NORMP   AT32_REMAP(3, 28, 4, 0x00)
#define AT32_UART4_RMP2    AT32_REMAP(3, 28, 4, 0x02)

/* SPIM */
#define AT32_SPIM_NORMP    AT32_REMAP(4, 0, 4, 0x00)
#define AT32_SPIM_RMP8     AT32_REMAP(4, 0, 4, 0x08)
#define AT32_SPIM_RMP9     AT32_REMAP(4, 0, 4, 0x09)

/* SWJJTAG */
#define AT32_SWJTAG_ENABLE AT32_REMAP(4, 16, 3, 0x00)
#define AT32_SWJTAG_PB4    AT32_REMAP(4, 16, 3, 0x01)
#define AT32_SWJTAG_DJTAG  AT32_REMAP(4, 16, 3, 0x02)
#define AT32_SWJTAG_DALLL  AT32_REMAP(4, 16, 3, 0x04)

/* XMC */
#define AT32_XMC_NORMP     AT32_REMAP(4, 24, 3, 0x00)
#define AT32_XMC_RMP1      AT32_REMAP(4, 24, 3, 0x01)
#define AT32_XMC_RMP2      AT32_REMAP(4, 24, 3, 0x02)

/* USART6 */
#define AT32_USART6_NORMP  AT32_REMAP(5, 20, 4, 0x00)
#define AT32_USART6_RMP1   AT32_REMAP(5, 20, 4, 0x01)

/* UART7 */
#define AT32_UART7_NORMP   AT32_REMAP(5, 24, 4, 0x00)
#define AT32_UART7_RMP1    AT32_REMAP(5, 24, 4, 0x01)

/* UART8 */
#define AT32_UART8_NORMP   AT32_REMAP(5, 28, 4, 0x00)
#define AT32_UART8_RMP1    AT32_REMAP(5, 28, 4, 0x01)

/* EMAC */
#define AT32_EMAC_NORMP    AT32_REMAP(5, 16, 2, 0x00)
#define AT32_EMAC_RMP1     AT32_REMAP(5, 16, 2, 0x01)

#endif /* AT32F403A_407_IOMAP_H_ */
